torvalds/linux/backports/drivers/realtek/8723bs/hal/rtl8723b/rtl8723b_mp.c
	pAdapter->mppriv.MptCtx.bStartContTx = bStart;

	//write_bbreg(pAdapter, rFixContTxRate, bFixContTxRate, bStart);

	if (pAdapter->mppriv.rateidx <= MPT_RATE_11M)
	{
		Hal_SetCCKContinuousTx(pAdapter, bStart);
	}
	else if ((pAdapter->mppriv.rateidx >= MPT_RATE_6M) &&
		 (pAdapter->mppriv.rateidx <= MPT_RATE_MCS15))
	{
		Hal_SetOFDMContinuousTx(pAdapter, bStart);
	}
#if 0
	// ADC turn on [bit24-21] adc port0 ~ port1
	if (!bStart) {
		write_bbreg(pAdapter, rRx_Wait_CCCA, read_bbreg(pAdapter, rRx_Wait_CCCA) | 0x01E00000);
	}
#endif
}



u8 MRateToHwRate8723B( u8 rate)
{
	u8	ret = DESC8723B_RATE1M;
		
	switch(rate)
	{
		// CCK and OFDM non-HT rates
	case MPT_RATE_1M:		ret = DESC8723B_RATE1M; break;
	case MPT_RATE_2M:		ret = DESC8723B_RATE2M; break;
	case MPT_RATE_55M:		ret = DESC8723B_RATE5_5M;	break;
	case MPT_RATE_11M:		ret = DESC8723B_RATE11M;	break;
	case MPT_RATE_6M:		ret = DESC8723B_RATE6M; break;
	case MPT_RATE_9M:		ret = DESC8723B_RATE9M; break;
	case MPT_RATE_12M:		ret = DESC8723B_RATE12M;	break;
	case MPT_RATE_18M:		ret = DESC8723B_RATE18M;	break;
	case MPT_RATE_24M:		ret = DESC8723B_RATE24M;	break;
	case MPT_RATE_36M:		ret = DESC8723B_RATE36M;	break;
	case MPT_RATE_48M:		ret = DESC8723B_RATE48M;	break;
	case MPT_RATE_54M:		ret = DESC8723B_RATE54M;	break;

		// HT rates since here
	case MPT_RATE_MCS0:		ret = DESC8723B_RATEMCS0;	break;
	case MPT_RATE_MCS1:		ret = DESC8723B_RATEMCS1;	break;
	case MPT_RATE_MCS2:		ret = DESC8723B_RATEMCS2;	break;
	case MPT_RATE_MCS3:		ret = DESC8723B_RATEMCS3;	break;
	case MPT_RATE_MCS4:		ret = DESC8723B_RATEMCS4;	break;
	case MPT_RATE_MCS5:		ret = DESC8723B_RATEMCS5;	break;
	case MPT_RATE_MCS6:		ret = DESC8723B_RATEMCS6;	break;
	case MPT_RATE_MCS7:		ret = DESC8723B_RATEMCS7;	break;
	case MPT_RATE_MCS8:		ret = DESC8723B_RATEMCS8;	break;
	case MPT_RATE_MCS9:		ret = DESC8723B_RATEMCS9;	break;
	case MPT_RATE_MCS10: ret = DESC8723B_RATEMCS10;	break;
	case MPT_RATE_MCS11: ret = DESC8723B_RATEMCS11;	break;
	case MPT_RATE_MCS12: ret = DESC8723B_RATEMCS12;	break;
	case MPT_RATE_MCS13: ret = DESC8723B_RATEMCS13;	break;
	case MPT_RATE_MCS14: ret = DESC8723B_RATEMCS14;	break;
	case MPT_RATE_MCS15: ret = DESC8723B_RATEMCS15;	break;
	case MPT_RATE_VHT1SS_MCS0:		ret = DESC8723B_RATEVHTSS1MCS0; break;
	case MPT_RATE_VHT1SS_MCS1:		ret = DESC8723B_RATEVHTSS1MCS1; break;
	case MPT_RATE_VHT1SS_MCS2:		ret = DESC8723B_RATEVHTSS1MCS2; break;
	case MPT_RATE_VHT1SS_MCS3:		ret = DESC8723B_RATEVHTSS1MCS3; break;
	case MPT_RATE_VHT1SS_MCS4:		ret = DESC8723B_RATEVHTSS1MCS4; break;
	case MPT_RATE_VHT1SS_MCS5:		ret = DESC8723B_RATEVHTSS1MCS5; break;
	case MPT_RATE_VHT1SS_MCS6:		ret = DESC8723B_RATEVHTSS1MCS6; break;
	case MPT_RATE_VHT1SS_MCS7:		ret = DESC8723B_RATEVHTSS1MCS7; break;
	case MPT_RATE_VHT1SS_MCS8:		ret = DESC8723B_RATEVHTSS1MCS8; break;
	case MPT_RATE_VHT1SS_MCS9:		ret = DESC8723B_RATEVHTSS1MCS9; break;	
	case MPT_RATE_VHT2SS_MCS0:		ret = DESC8723B_RATEVHTSS2MCS0; break;
	case MPT_RATE_VHT2SS_MCS1:		ret = DESC8723B_RATEVHTSS2MCS1; break;
	case MPT_RATE_VHT2SS_MCS2:		ret = DESC8723B_RATEVHTSS2MCS2; break;
	case MPT_RATE_VHT2SS_MCS3:		ret = DESC8723B_RATEVHTSS2MCS3; break;
	case MPT_RATE_VHT2SS_MCS4:		ret = DESC8723B_RATEVHTSS2MCS4; break;
	case MPT_RATE_VHT2SS_MCS5:		ret = DESC8723B_RATEVHTSS2MCS5; break;
	case MPT_RATE_VHT2SS_MCS6:		ret = DESC8723B_RATEVHTSS2MCS6; break;
	case MPT_RATE_VHT2SS_MCS7:		ret = DESC8723B_RATEVHTSS2MCS7; break;
	case MPT_RATE_VHT2SS_MCS8:		ret = DESC8723B_RATEVHTSS2MCS8; break;
	case MPT_RATE_VHT2SS_MCS9:		ret = DESC8723B_RATEVHTSS2MCS9; break;	
	default:		break;
	}

	return ret;
}


u8 HwRateToMRate8723B(u8	 rate)
{

	u8	ret_rate = MGN_1M;


	switch(rate)
	{
	
		case DESC8723B_RATE1M:		ret_rate = MGN_1M;		break;
		case DESC8723B_RATE2M:		ret_rate = MGN_2M;		break;
		case DESC8723B_RATE5_5M:		ret_rate = MGN_5_5M;		break;
		case DESC8723B_RATE11M: 	ret_rate = MGN_11M; 	break;
		case DESC8723B_RATE6M:		ret_rate = MGN_6M;		break;
		case DESC8723B_RATE9M:		ret_rate = MGN_9M;		break;
		case DESC8723B_RATE12M: 	ret_rate = MGN_12M; 	break;
		case DESC8723B_RATE18M: 	ret_rate = MGN_18M; 	break;
		case DESC8723B_RATE24M: 	ret_rate = MGN_24M; 	break;
		case DESC8723B_RATE36M: 	ret_rate = MGN_36M; 	break;
		case DESC8723B_RATE48M: 	ret_rate = MGN_48M; 	break;
		case DESC8723B_RATE54M: 	ret_rate = MGN_54M; 	break;			
		case DESC8723B_RATEMCS0:	ret_rate = MGN_MCS0;		break;
		case DESC8723B_RATEMCS1:	ret_rate = MGN_MCS1;		break;
		case DESC8723B_RATEMCS2:	ret_rate = MGN_MCS2;		break;
		case DESC8723B_RATEMCS3:	ret_rate = MGN_MCS3;		break;
		case DESC8723B_RATEMCS4:	ret_rate = MGN_MCS4;		break;
		case DESC8723B_RATEMCS5:	ret_rate = MGN_MCS5;		break;
		case DESC8723B_RATEMCS6:	ret_rate = MGN_MCS6;		break;
		case DESC8723B_RATEMCS7:	ret_rate = MGN_MCS7;		break;
		case DESC8723B_RATEMCS8:	ret_rate = MGN_MCS8;		break;
		case DESC8723B_RATEMCS9:	ret_rate = MGN_MCS9;		break;
		case DESC8723B_RATEMCS10:	ret_rate = MGN_MCS10;	break;
		case DESC8723B_RATEMCS11:	ret_rate = MGN_MCS11;	break;
		case DESC8723B_RATEMCS12:	ret_rate = MGN_MCS12;	break;
		case DESC8723B_RATEMCS13:	ret_rate = MGN_MCS13;	break;
		case DESC8723B_RATEMCS14:	ret_rate = MGN_MCS14;	break;
		case DESC8723B_RATEMCS15:	ret_rate = MGN_MCS15;	break;
		case DESC8723B_RATEVHTSS1MCS0:	ret_rate = MGN_VHT1SS_MCS0; 	break;
		case DESC8723B_RATEVHTSS1MCS1:	ret_rate = MGN_VHT1SS_MCS1; 	break;
		case DESC8723B_RATEVHTSS1MCS2:	ret_rate = MGN_VHT1SS_MCS2; 	break;
		case DESC8723B_RATEVHTSS1MCS3:	ret_rate = MGN_VHT1SS_MCS3; 	break;
		case DESC8723B_RATEVHTSS1MCS4:	ret_rate = MGN_VHT1SS_MCS4; 	break;
		case DESC8723B_RATEVHTSS1MCS5:	ret_rate = MGN_VHT1SS_MCS5; 	break;
		case DESC8723B_RATEVHTSS1MCS6:	ret_rate = MGN_VHT1SS_MCS6; 	break;
		case DESC8723B_RATEVHTSS1MCS7:	ret_rate = MGN_VHT1SS_MCS7; 	break;
		case DESC8723B_RATEVHTSS1MCS8:	ret_rate = MGN_VHT1SS_MCS8; 	break;
		case DESC8723B_RATEVHTSS1MCS9:	ret_rate = MGN_VHT1SS_MCS9; 	break;
		case DESC8723B_RATEVHTSS2MCS0:	ret_rate = MGN_VHT2SS_MCS0; 	break;
		case DESC8723B_RATEVHTSS2MCS1:	ret_rate = MGN_VHT2SS_MCS1; 	break;
		case DESC8723B_RATEVHTSS2MCS2:	ret_rate = MGN_VHT2SS_MCS2; 	break;
		case DESC8723B_RATEVHTSS2MCS3:	ret_rate = MGN_VHT2SS_MCS3; 	break;
		case DESC8723B_RATEVHTSS2MCS4:	ret_rate = MGN_VHT2SS_MCS4; 	break;
		case DESC8723B_RATEVHTSS2MCS5:	ret_rate = MGN_VHT2SS_MCS5; 	break;
		case DESC8723B_RATEVHTSS2MCS6:	ret_rate = MGN_VHT2SS_MCS6; 	break;
		case DESC8723B_RATEVHTSS2MCS7:	ret_rate = MGN_VHT2SS_MCS7; 	break;
		case DESC8723B_RATEVHTSS2MCS8:	ret_rate = MGN_VHT2SS_MCS8; 	break;
		case DESC8723B_RATEVHTSS2MCS9:	ret_rate = MGN_VHT2SS_MCS9; 	break;				
		
		default:							
			DBG_8192C("HwRateToMRate8723B(): Non supported Rate [%x]!!!\n",rate );
			break;
	}	
	return ret_rate;
}

#endif // CONFIG_MP_INCLUDE

